# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Categories..::..ForwardIterator Method
Categories Class See Also
---
Retrieves a forward moving iterator to the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override CategoryNameMapIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overrides Function ForwardIterator As CategoryNameMapIterator
```

Visual C++
---
```text
public:
virtual CategoryNameMapIterator^ ForwardIterator() override
```

# ### Return Value
A forward moving iterator to the map.
# See Also
Categories Class
Autodesk.Revit.DB Namespace